Функция НайтиИЛИСоздатьПоНаименованию(ТекПользователь) Экспорт
	
	Пользователь = НайтиПоНаименованию(ТекПользователь.Имя);
	
	Если (Пользователь.Пустая()) Тогда
		НовыйПользователь = СоздатьЭлемент();
		НовыйПользователь.Наименование = ТекПользователь.Имя;
		НовыйПользователь.ПолноеИмя = ТекПользователь.ПолноеИмя;
		
		НовыйПользователь.ЗаполнитьТаблицуРолей();
		НовыйПользователь.Записать();
		
		Пользователь = НовыйПользователь.Ссылка;
	КонецЕсли;
	
	Возврат Пользователь;
		
КонецФункции