Процедура ЗаполнитьТаблицуРолей() Экспорт
	
	ТекПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	СписокРолей.Очистить();
	
	Роли = Метаданные.Роли;
	
	Для Каждого Роль Из Роли Цикл
		
		НовСтрока = СписокРолей.Добавить();
		НовСтрока.ИмяРоли = Роль.Имя;
		НовСтрока.ПредставлениеРоли = Роль.Синоним;
		НовСтрока.Активен = ТекПользователь.Роли.Содержит(Роль);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ТекПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если ТекПользователь = Неопределено Тогда
		ТекПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		ТекПользователь.Имя = Наименование;
		ТекПользователь.ПолноеИмя = ПолноеИмя;				
	КонецЕсли;
	
	МассивРолей = СписокРолей.НайтиСтроки(Новый Структура("Активен", Истина));
	Для Каждого СтрокаРоли Из МассивРолей Цикл
		ТекПользователь.Роли.Добавить(Метаданные.Роли.Найти(СтрокаРоли.ИмяРоли));
	КонецЦикла;
	ТекПользователь.Записать();
	
КонецПроцедуры











